src/test/resources/betamax/tapes/who_is_osu.yaml

!tape
name: who-is-osu
interactions:
- recorded: 2013-02-22T15:28:16.208Z
  request:
    method: POST
    uri: http://www.webservicex.net/whois.asmx
    headers:
      Accept: '*/*'
      Cache-Control: no-cache
      Content-Length: '193'
      Content-Type: text/xml; charset=UTF-8
      Host: www.webservicex.net
      Pragma: no-cache
      Proxy-Connection: keep-alive
      SOAPAction: '"http://www.webservicex.net/GetWhoIS"'
      User-Agent: Apache CXF 2.4.6
    body: <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><GetWhoIS xmlns="http://www.webservicex.net"><HostName>osu.edu</HostName></GetWhoIS></soap:Body></soap:Envelope>
  response:
    status: 200
    headers:
      Cache-Control: private, max-age=0
      Content-Type: text/xml; charset=utf-8
      Date: Fri, 22 Feb 2013 15:30:59 GMT
      Server: Microsoft-IIS/7.0
      X-AspNet-Version: 4.0.30319
      X-Powered-By: ASP.NET
    body: "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><GetWhoISResponse xmlns=\"\
      http://www.webservicex.net\"><GetWhoISResult>\nThis Registry database contains ONLY .EDU domains. \nThe data in the EDUCAUSE Whois database is provided \nby EDUCAUSE for information purposes in order to \nassist in the process of obtaining information\
      \ about \nor related to .edu domain registration records. \n\nThe EDUCAUSE Whois database is authoritative for the \n.EDU domain.         \n\nA Web interface for the .EDU EDUCAUSE Whois Server is \navailable at: http://whois.educause.net \n\nBy submitting\
      \ a Whois query, you agree that this information \nwill not be used to allow, enable, or otherwise support \nthe transmission of unsolicited commercial advertising or \nsolicitations via e-mail.  The use of electronic processes to \nharvest information\
      \ from this server is generally prohibited \nexcept as reasonably necessary to register or modify .edu \ndomain names.\n\nYou may use \"%\" as a wildcard in your search. For further \ninformation regarding the use of this WHOIS server, please \ntype: help\
      \ \n\n--------------------------\n\nDomain Name: OSU.EDU\n\nRegistrant:\n   The Ohio State University\n   320 West 8th Ave\n   Columbus, OH 43201-2331\n   UNITED STATES\n\nAdministrative Contact:\n\n   Zonemaster - External POC\n   The Ohio State University\n\
      \   320 West 8th Ave\n   Columbus, OH 43201-2331\n   UNITED STATES\n   (614) 688-4357\n   hostmaster@osu.edu\n\nTechnical Contact:\n\n   Zonemaster - External POC\n   The Ohio State University\n   320 West 8th Ave\n   Columbus, OH 43201-2331\n   UNITED\
      \ STATES\n   (614) 688-4357\n   hostmaster@osu.edu\n\nName Servers: \n   NS1.NET.OHIO-STATE.EDU      \r\n   NS2.NET.OHIO-STATE.EDU      \r\n\nDomain record activated:    06-Oct-1989\nDomain record last updated: 10-Oct-2007\nDomain expires:            \
      \ 31-Jul-2013\n\n\r\n</GetWhoISResult></GetWhoISResponse></soap:Body></soap:Envelope>"
